-- 실습문제

-- DML
-- 1)
SELECT c.*
  FROM customer c;

INSERT INTO customer (USERID, NAME, BIRTHYEAR, REGDATE, ADDRESS)
VALUES ('C001', '김수현', 1988, sysdate, '경기');

INSERT INTO customer (USERID, NAME, BIRTHYEAR, REGDATE, ADDRESS)
VALUES ('C002', '이효리', 1979, sysdate, '제주');

INSERT INTO customer (USERID, NAME, BIRTHYEAR, REGDATE, ADDRESS)
VALUES ('C003', '원빈', 1977, sysdate, '강원');

/*
1 행 이(가) 삽입되었습니다.


1 행 이(가) 삽입되었습니다.


1 행 이(가) 삽입되었습니다.
*/
SELECT c.*
  FROM customer c
;
/*------------------------------------------
C001	김수현	1988	18/07/02	경기
C002	이효리	1979	18/07/02	제주
C003	원빈	1977	18/07/02	강원
-------------------------------------------*/

-- 2)
UPDATE customer c
   SET c.NAME = '차태현'
     , c.BIRTHYEAR = 1976
 WHERE c.USERID = 'C001'
;
/*---------------------------------------
C001	차태현	1976	18/07/02	경기
C002	이효리	1979	18/07/02	제주
C003	원빈	1977	18/07/02	강원
----------------------------------------*/

-- 3)
UPDATE customer c
   SET c.ADDRESS = '서울'
;
/*---------------------------------------
C001	차태현	1976	18/07/02	서울
C002	이효리	1979	18/07/02	서울
C003	원빈	1977	18/07/02	서울
----------------------------------------*/
COMMIT;

-- 4)
DELETE FROM customer c
 WHERE c.USERID = 'C003'
;
/*---------------------------------------
C001	차태현	1976	18/07/02	서울
C002	이효리	1979	18/07/02	서울
----------------------------------------*/

-- 5)
DELETE FROM customer c;
/*----------------------------------
인출된 모든 행 : 0
-----------------------------------*/

-- 6)
ROLLBACK;
SELECT c.*
  FROM customer c;
/*-----------------------------------------
C001	차태현	1976	18/07/02	서울
C002	이효리	1979	18/07/02	서울
C003	원빈	1977	18/07/02	서울
-----------------------------------------*/
TRUNCATE TABLE customer;

SELECT c.*
  FROM customer c;
/*--------------------------------------
인출된 모든 행 : 0
---------------------------------------*/